tutorials/fsi/3dTube/fluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default bdf2;
}

gradSchemes
{
    default Gauss;
}

divSchemes
{
    default Gauss linear;
    div(phi,U)   Gauss skewCorrected linear;
//    div(phi,U) Gauss linearUpwind cellLimited leastSquares 1;
}

laplacianSchemes
{
    default Gauss linear corrected;
}

interpolationSchemes
{
    default linear corrected;
}

snGradSchemes
{
    default corrected;
}

fluxRequired
{
    default         no;
    p;
}


// ************************************************************************* //
